# St7GetGeometryFaceOffset1

Returns the offset assigned to the specified geometry face.

long St7GetGeometryFaceOffset1(long uID, long FaceNum, double* Doubles)
Input Parameters
uID
Strand7 model file ID.
FaceNum
Face number.
Output Parameters
Doubles[0]
Offset value.